; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_3 ?v3 - type_1 ?v8 - type_2)
 	      (pred_2 ?v6 - object ?v8 - type_2)
	      (pred_4 ?v3 - type_1 ?v7 - type_3)
	      (pred_1 ?v3 - type_1 ?v6 - object ?v7 - type_3))

   (:action op_2
       :parameters  (?v3 - type_1 ?v5 ?v2 - type_2)
       :precondition (and  (pred_3 ?v3 ?v5))
       :effect (and  (pred_3 ?v3 ?v2)
		     (not (pred_3 ?v3 ?v5))))

   (:action op_1
       :parameters (?v3 - type_1 ?v4 - object ?v1 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_2 ?v4 ?v1) (pred_3 ?v3 ?v1) (pred_4 ?v3 ?v7))
       :effect (and (pred_1 ?v3 ?v4 ?v7)
		    (not (pred_2 ?v4 ?v1)) 
		    (not (pred_4 ?v3 ?v7))))

   (:action op_3
       :parameters (?v3 - type_1 ?v4 - object ?v1 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_1 ?v3 ?v4 ?v7) (pred_3 ?v3 ?v1))
       :effect (and (pred_2 ?v4 ?v1)
		    (pred_4 ?v3 ?v7)
		    (not (pred_1 ?v3 ?v4 ?v7)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_06 - type_1
obj_07 obj_04 - type_3
obj_02 obj_03 obj_08 obj_01 - type_2
obj_05 obj_09 obj_10 - object)
(:init
(pred_3 obj_06 obj_01)
(pred_4 obj_06 obj_07)
(pred_4 obj_06 obj_04)
(pred_2 obj_05 obj_01)
(pred_2 obj_09 obj_02)
(pred_2 obj_10 obj_03)
)
(:goal
(and
(pred_2 obj_05 obj_03)
(pred_2 obj_09 obj_08)
(pred_2 obj_10 obj_02)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_06 ?b obj_04))))
)
)

; plan
1. (op_1 obj_06 obj_05 obj_01 obj_07)
   deleted: (pred_2 obj_05 obj_01) (pred_4 obj_06 obj_07)
   added: (pred_1 obj_06 obj_05 obj_07)
   goals met: 0 of 3
2. (op_2 obj_06 obj_01 obj_03)
   deleted: (pred_3 obj_06 obj_01)
   added: (pred_3 obj_06 obj_03)
   goals met: 0 of 3
3. (op_3 obj_06 obj_05 obj_03 obj_07)
   deleted: (pred_1 obj_06 obj_05 obj_07)
   added: (pred_2 obj_05 obj_03) (pred_4 obj_06 obj_07)
   goals met: 1 of 3
4. (op_1 obj_06 obj_10 obj_03 obj_07)
   deleted: (pred_2 obj_10 obj_03) (pred_4 obj_06 obj_07)
   added: (pred_1 obj_06 obj_10 obj_07)
   goals met: 1 of 3
5. (op_2 obj_06 obj_03 obj_02)
   deleted: (pred_3 obj_06 obj_03)
   added: (pred_3 obj_06 obj_02)
   goals met: 1 of 3
6. (op_3 obj_06 obj_10 obj_02 obj_07)
   deleted: (pred_1 obj_06 obj_10 obj_07)
   added: (pred_2 obj_10 obj_02) (pred_4 obj_06 obj_07)
   goals met: 2 of 3
7. (op_1 obj_06 obj_09 obj_02 obj_07)
   deleted: (pred_2 obj_09 obj_02) (pred_4 obj_06 obj_07)
   added: (pred_1 obj_06 obj_09 obj_07)
   goals met: 2 of 3
8. (op_2 obj_06 obj_02 obj_08)
   deleted: (pred_3 obj_06 obj_02)
   added: (pred_3 obj_06 obj_08)
   goals met: 2 of 3
9. (op_3 obj_06 obj_09 obj_08 obj_07)
   deleted: (pred_1 obj_06 obj_09 obj_07)
   added: (pred_2 obj_09 obj_08) (pred_4 obj_06 obj_07)
   goals met: 3 of 3
